Plan for **staging** is ready.
**Branch/Commit:** refs/heads/staging / 567a9f4fcd3e7fbf4a3ea83eafae75b6311a7310
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/19803319197

**Plan (last ~500 lines):**
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.helm.helm_release.external_dns["this"] will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = true
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "cloudflare.apiTokenSecretRef.key"
          + value = "cloudflare_api_token"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "cloudflare.apiTokenSecretRef.name"
          + value = "external-dns-cloudflare"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "cloudflare.email"
            # (2 unchanged attributes hidden)
        }
      + set {
          + name  = "cloudflare.proxied"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "policy"
          + value = "sync"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "provider"
          + value = "cloudflare"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "registry"
          + value = "txt"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
            # (1 unchanged attribute hidden)
        }
    }

  # module.helm.kubernetes_service_account.external_dns will be created
  + resource "kubernetes_service_account" "external_dns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
